Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 4, 8, 64)          640       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 2, 6, 32)          18464     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 1, 3, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 96)                0         
_________________________________________________________________
dense (Dense)                (None, 512)               49664     
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 2565      
=================================================================
Total params: 71,333
Trainable params: 71,333
Non-trainable params: 0
_________________________________________________________________

Extra Information:
 -- test_accuracy: 0.931
 -- test_loss: 0.191
 -- epochs_num: 50
 -- datasets_shapes: (605, 6, 10, 1), (605, 5)
 -- single_data_shapes: (6, 10, 1), (5,)
 -- single_one_hot_encoding: [0. 0. 0. 1. 0.]
 -- train_test_split (605, 260): 0.430
